fafa10/app/Models/FilmModel.php

    public function getAllDataJoin()
    {
        $query = $this->db->table("film")
            ->select("film.*,genre.nama_genre")
            ->join("genre", "genre.id = film.id_genre");
        return $query->get()->getResultArray();
---
SELECT `film`.*, `genre`.`nama_genre`
FROM `film`
JOIN `genre` ON `genre`.`id` = `film`.`id_genre`